Import library moduls

In [2]:
import numpy as np
import pandas as pd

In [5]:
df_train = pd.read_csv('data/train.csv')

df_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [18]:
df_train.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [20]:
df_train.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [30]:
df_train['Survived']

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: Survived, Length: 891, dtype: int64

In [31]:
df_train['Survived'].value_counts()

0    549
1    342
Name: Survived, dtype: int64

Q1. Survival probability for a passenger.

In [46]:
len(df_train[df_train['Survived']==1]) / len(df_train['Survived'])

0.3838383838383838

In [50]:
df_train['Survived'].value_counts(normalize=True)

0    0.616162
1    0.383838
Name: Survived, dtype: float64

Q2. Survival probability for a female passenger.

In [80]:
df_train['Sex'].value_counts()

male      577
female    314
Name: Sex, dtype: int64

In [79]:
df_female = df_train[df_train['Sex']=='female']
df_female.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [61]:
df_female['Survived'].value_counts(normalize=True)

1    0.742038
0    0.257962
Name: Survived, dtype: float64

Q3. Probability that a person is a female and survives.

In [81]:
df_female[(df_female['Sex'] == 'female') & (df_female['Survived'] == 1)]['Survived'].count() / df_train['Survived'].count()

0.2615039281705948

Q4. It is more probable for a person from the first class to survive as compared to the second or third class. (True/False)

In [83]:
df_train['Pclass'].value_counts()

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [95]:
# class 1
df_train[(df_train['Pclass'] == 1) & (df_train['Survived'] == 1)]['Survived'].count()\
    / df_train[df_train['Pclass']==1]['Survived'].count()

0.6296296296296297

In [96]:
# class 2
df_train[(df_train['Pclass'] == 2) & (df_train['Survived'] == 1)]['Survived'].count()\
    / df_train[df_train['Pclass']==2]['Survived'].count()

0.47282608695652173

In [97]:
# class 3
df_train[(df_train['Pclass'] == 3) & (df_train['Survived'] == 1)]['Survived'].count()\
    / df_train[df_train['Pclass']==3]['Survived'].count()

0.24236252545824846